# git

Niz に git コマンドの操作をお願いすることがあります. 本ドキュメントではそれにまつわるルーリングについて示します.

## 前提条件

.gitignore に記載されているファイルは全てを ignore してください.

## 私がお願いするであろうコマンドについて

私が Niz にお願いするであろうコマンドはほとんどこのうちのどれかです

- commit を行う
  - 現状の変更内容, ないしはお願いの内容に応じて発生した変更内容に応じて git add & git commit を行う
  - 全てを一つの commit にまとめようとせずに, commit は作業の一単位として小さく独立するように commit してください
  - commit 内容には「何を行ったのか」を重点的に書いてください. その理由がややハック気味であったり歴史的背景に由来するなど, 後世の世代に説明が必要なものであればなぜそうしたかまで書いてください
  - また前提として私は commit message については全て英語を好みます.
  - また commit を行った際には, 一つ一つどういう変更に対してどういう commit メッセージにしたかを通告してください
- stash を行う
  - 現在の変更内容をまとめて一つの stash として stash を行ってください
  - なお stash のメッセージとしては、「どういう変更であるか」というのをわかりやすく記述しておいてください
  - また最後に stash メッセージも教えてください
- commit の移動
  - ある branch に存在する A...B についての commit について, A~B までまとめて別の branch へと commit しなおしてください. その別の branch などは私がその際に指定します
  - なおそれを行う際には原則 commit message は一切変更しないでください
- pull request の作成
  - GitHub 上で pull request を作ってください
   - gh コマンドを利用してください
   - PR 上の title では何をやったかを英語で記述してください
   - PR 上の description ではなぜそれを行う必要があるか, その課題の解消のために何をしたかなどを日本語で記述してください